#### Drop NA and Fill nan

In [6]:
import numpy as np
import pandas as pd

In [10]:
#define a dictionary with key and values
d={'A':[1,5,np.nan],'B':[2,np.nan,np.nan],'C':[0,3,7]}

In [14]:
#fill missing values with np.nan 
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  2.0  0
1  5.0  NaN  3
2  NaN  NaN  7

In [15]:
#Drop nan values(note df.dropna not pd)
df.dropna()
#By default row is selected and any row with na will be discarded

     A    B  C
0  1.0  2.0  0

In [16]:
#To select a column make axis 1
df.dropna(axis=1)

   C
0  0
1  3
2  7

In [18]:
#Threshold(Require that many non NA values)
df.dropna(thresh=2)

     A    B  C
0  1.0  2.0  0
1  5.0  NaN  3

In [21]:
#Fill values with  a string
df.fillna("Fill NA")
# OR
df.fillna(value="Some value")

            A           B  C
0           1           2  0
1           5  Some value  3
2  Some value  Some value  7

In [20]:
#Fill with mean values
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  2.0  0
1  5.0  3.0  3
2  3.0  3.0  7